{
    "locales": {
        "en": {
            "title": "Portfolio",
            "title_long_prefix": "Take a look at",
            "title_long": "My **Portfolio**"
        },

        "es": {
            "title": "Portafolio",
            "title_long_prefix": "Explora",
            "title_long": "Mi **Portafolio**"
        },

        "fr": {
            "title": "Portfolio",
            "title_long_prefix": "Découvrez",
            "title_long": "Mon **Portfolio**"
        },

        "ko": {
            "title": "포트폴리오",
            "title_long_prefix": "이것은 내",
            "title_long": "**포트폴리오**입니다"
        }
    },

    "articles": [
        {
            "id": "portfolio",
            "component": "ArticlePortfolio",
            "config": {},
            "locales": {},

            "categories": [
                {
                    "id": "websites",
                    "locales": {
                        "en": {"singular": "Website", "plural": "Web"},
                        "es": {"singular": "Sitio web", "plural": "Web"},
                        "fr": {"singular": "Site web", "plural": "Web"},
                        "ko": {"singular": "웹사이트", "plural": "웹"}
                    }
                },
                {
                    "id": "utilities",
                    "locales": {
                        "en": {"singular": "Utility", "plural": "Utilities"},
                        "es": {"singular": "Utilidad", "plural": "Utilidades"},
                        "fr": {"singular": "Utilitaire", "plural": "Utilitaires"},
                        "ko": {"singular": "유틸리티", "plural": "유틸리티들"}
                    }
                }
            ],

            "items": [
                {
                    "categoryId": "websites",
                    "icon": {
                        "img": "images/pictures/project-logo-1.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },

                    "links": [
                        {"faIcon": "fa-brands fa-github", "href": "https://github.com/awaisdev2/mern-frontend"}
                    ],

                    "media": {
                        "youtubeVideo": null,
                        "screenshots": {
                            "aspectRatio": null,
                            "images": []
                        }
                    },

                    "locales": {
                        "en": {
                            "title": "Expense Management - Frontend",
                            "text": "The **Expense Management** Website frontend uses React, Bootstrap, and React-Bootstrap for a modern, responsive UI. Formik and Yup handle form validation, with animated login and registration components. Users can track expenses, set budgets, view reports, and upload profile pictures, along with features like notes and to-do lists for comprehensive financial management.",
                            "tags": ["React", "Expenses Manager", "Bootstrap"]
                        },
                        "es": {
                            "title": "Expense Management - Frontend",
                            "text": "La interfaz del sitio web **Administración de gastos** utiliza React, Bootstrap y React-Bootstrap para una interfaz de usuario moderna y receptiva. Formik y Yup manejan la validación de formularios, con componentes animados de inicio de sesión y registro que. Los usuarios pueden realizar un seguimiento de los gastos, establecer presupuestos, ver informes y cargar imágenes de perfil, junto con funciones como notas y listas de tareas pendientes para una gestión financiera integral.",
                            "tags": ["React", "Expenses Manager", "Bootstrap"]
                        },
                        "fr": {
                            "title": "Expense Management - Frontend",
                            "text": "L'interface du site Web **Expense Management** utilise React, Bootstrap et React-Bootstrap pour une interface utilisateur moderne et réactive. Formik et Yup gèrent la validation des formulaires, avec des composants animés de connexion et d'enregistrement à l'aide. Les utilisateurs peuvent suivre leurs dépenses, définir des budgets, consulter des rapports et télécharger des photos de profil, ainsi que des fonctionnalités telles que des notes et des listes de tâches pour une gestion financière complète.",
                            "tags": ["React", "Expenses Manager", "Bootstrap"]
                        },
                        "ko": {
                            "title": "Expense Management - Frontend",
                            "text": "**비용 관리** 웹사이트 프런트엔드는 현대적이고 반응성이 뛰어난 UI를 위해 React, Bootstrap 및 React-Bootstrap을 사용합니다. Formik과 Yup은 애니메이션 로그인 및 등록 구성 요소를 사용하여 양식 유효성 검사를 처리합니다. 사용자는 포괄적인 재무 관리를 위한 메모 및 할 일 목록과 같은 기능과 함께 비용을 추적하고, 예산을 설정하고, 보고서를 보고, 프로필 사진을 업로드할 수 있습니다.",
                            "tags": ["React", "Expenses Manager", "Bootstrap"]
                        }
                    }
                },

                {
                    "categoryId": "websites",
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-school",
                        "faColors": {"bg": "#111", "fill": "#EEE"}
                    },

                    "links": [
                        {"faIcon": "fa-solid fa-link", "href": "https://theaimschool.pk"}
                    ],

                    "media": {
                        "youtubeVideo": "",
                        "screenshots": {
                            "aspectRatio": null,
                            "images": []
                        }
                    },

                    "locales": {
                        "en": {
                            "title": "The Aims School",
                            "text": "I designed and developed the official website for **The Aims School**, utilizing modern web technologies to create a visually engaging and seamless user experience. Built with React, the website offers a dynamic and responsive interface, ensuring optimal performance across devices. To enhance interactivity and animations, I incorporated Framer Motion and GSAP, creating smooth transitions and engaging visual effects that captivate users.",
                            "tags": ["React", "GSAP", "Framer motion"]
                        },
                        "es": {
                            "title": "The Aims School",
                            "text": "Diseñé y desarrollé el sitio web oficial de **The Aims School**, utilizando tecnologías web modernas para crear una experiencia de usuario visualmente atractiva y fluida. Creado con React, el sitio web ofrece una interfaz dinámica y responsiva, lo que garantiza un rendimiento óptimo en todos los dispositivos. Para mejorar la interactividad y las animaciones, incorporé Framer Motion y GSAP, creando transiciones suaves y atractivos efectos visuales que cautivan a los usuarios.",
                            "tags": ["React", "GSAP", "Framer motion"]
                        },
                        "fr": {
                            "title": "The Aims School",
                            "text": "J'ai conçu et développé le site Web officiel de l'Aims School, en utilisant les technologies Web modernes pour créer une expérience utilisateur visuellement attrayante et transparente. Construit avec React, le site Web offre une interface dynamique et réactive, garantissant des performances optimales sur tous les appareils. Pour améliorer l'interactivité et les animations, j'ai intégré Framer Motion et GSAP, créant des transitions fluides et des effets visuels attrayants qui captivent les utilisateurs.",
                            "tags": ["React", "GSAP", "Framer motion"]
                        },
                        "ko": {
                            "title": "The Aims School",
                            "text": "저는 시각적으로 매력적이고 원활한 사용자 경험을 만들기 위해 최신 웹 기술을 활용하여 **The Aims School**의 공식 웹사이트를 디자인하고 개발했습니다. React로 구축된 이 웹사이트는 역동적이고 반응이 빠른 인터페이스를 제공하여 여러 기기에서 최적의 성능을 보장합니다. 상호작용성과 애니메이션을 향상시키기 위해 Framer Motion과 GSAP를 통합하여 사용자를 사로잡는 부드러운 전환과 매력적인 시각 효과를 만들었습니다.",
                            "tags": ["React", "GSAP", "Framer motion"]
                        }
                    }
                },

                {
                    "categoryId": "utilities",
                    "icon": {
                        "img": "images/pictures/project-logo-3.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },

                    "links": [
                        {"faIcon": "fa-brands fa-github", "href": "https://github.com/awaisdev2/mern-backend"}
                    ],

                    "media": {
                    },

                    "locales": {
                        "en": {
                            "title": "Expense Management - Backend",
                            "text": "The **Expense Management** helps users track and manage finances with features like categorization, reports, and budgeting tools. It provides clear financial insights and simplifies expense tracking for effective oversight. It also has notes, todos and profile picture uploader feature which allow users to upload their own profile picture.",
                            "tags": ["API", "REST", "Backend"]
                        },
                        "es": {
                            "title": "Expense Management - Backend",
                            "text": "**Gestión de gastos** ayuda a los usuarios a realizar un seguimiento y gestionar las finanzas con funciones como categorización, informes y herramientas de elaboración de presupuestos. Proporciona información financiera clara y simplifica el seguimiento de gastos para una supervisión eficaz. También tiene notas, todos y la función de carga de imágenes de perfil que permiten a los usuarios cargar su propia imagen de perfil.",
                            "tags": ["API", "REST", "Backend"]
                        },
                        "fr": {
                            "title": "Expense Management - Backend",
                            "text": "La **Gestion des dépenses** aide les utilisateurs à suivre et à gérer leurs finances grâce à des fonctionnalités telles que la catégorisation, les rapports et les outils de budgétisation. Il fournit des informations financières claires et simplifie le suivi des dépenses pour une surveillance efficace. Il dispose également d'une fonction de téléchargement de notes, de tâches et de photos de profil qui permet aux utilisateurs de télécharger leur propre photo de profil.",
                            "tags": ["API", "REST", "Backend"]
                        },
                        "ko": {
                            "title": "Expense Management - Backend",
                            "text": "**비용 관리**는 분류, 보고서, 예산 도구 등의 기능을 통해 사용자가 재정을 추적하고 관리하는 데 도움이 됩니다. 이는 명확한 재무 통찰력을 제공하고 효과적인 감독을 위해 비용 추적을 단순화합니다. 또한 사용자가 자신의 프로필 사진을 업로드할 수 있는 메모, 할 일 및 프로필 사진 업로더 기능도 있습니다.",
                            "tags": ["API", "REST", "Backend"]
                        }
                    }
                },

                {
                    "categoryId": "utilities",
                    "icon": {
                        "img": "images/pictures/project-logo-4.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },

                    "links": [
                        {"faIcon": "fa-brands fa-github", "href": "https://github.com/awaisdev2/nodejs_backend"}
                    ],

                    "media": {
                    },

                    "locales": {
                        "en": {
                            "title": "To-Do Management - Backend",
                            "text": "A simple and efficient web application for task management, allowing users to create, update, and organize tasks with ease. Featuring essential functionalities like task titles, descriptions, and a user-friendly interface, it simplifies task tracking and helps users stay on top of their goals without requiring authentication.",
                            "tags": ["API", "REST", "Backend"]
                        },
                        "es": {
                            "title": "To-Do Management - Backend",
                            "text": "Una aplicación web sencilla y eficiente para la gestión de tareas que permite a los usuarios crear, actualizar y organizar tareas con facilidad. Con funcionalidades esenciales como títulos de tareas, descripciones y una interfaz fácil de usar, simplifica el seguimiento de tareas y ayuda a los usuarios a mantenerse al tanto de sus objetivos sin necesidad de autenticación.",
                            "tags": ["API", "REST", "Backend"]
                        },
                        "fr": {
                            "title": "To-Do Management - Backend",
                            "text": "Une application Web simple et efficace pour la gestion des tâches, permettant aux utilisateurs de créer, mettre à jour et organiser des tâches en toute simplicité. Doté de fonctionnalités essentielles telles que des titres de tâches, des descriptions et une interface conviviale, il simplifie le suivi des tâches et aide les utilisateurs à rester au top de leurs objectifs sans nécessiter d'authentification.",
                            "tags": ["API", "REST", "Backend"]
                        },
                        "ko": {
                            "title": "To-Do Management - Backend",
                            "text": "작업 관리를 위한 간단하고 효율적인 웹 애플리케이션으로, 사용자가 작업을 쉽게 생성, 업데이트 및 구성할 수 있습니다. 작업 제목, 설명, 사용자 친화적인 인터페이스와 같은 필수 기능을 갖춘 이 앱은 작업 추적을 단순화하고 사용자가 인증 없이도 목표를 지속적으로 달성할 수 있도록 도와줍니다.",
                            "tags": ["API", "REST", "Backend"]
                        }
                    }
                }
            ]
        }
    ]
}